Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དུས་མ་ལགས་པར་གསོལ་དུ་རུང་བའི་གུང་སྐྱེམས་བདག་གིས་སྦྱར་བ་གསོལ་དུ་ཅི་གནང་ཞེས་བྱས་ནས་
en: Please accept the beverages I shall prepare for you when it is no longer proper for you to eat.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཀཻ་ནེ་ཡ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented by his silence.

source: དེ་ནས་དྲང་སྲོང་ཀཻ་ནེ་ཡས། བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་བཏུང་བའི་རྣམ་གྲངས་བརྒྱད་སྦྱར་ཏེ། ཀུ་ཤུ་དང་ཆུ་ཤིང་གི་འབྲས་བུ་དང་རྒྱ་ཤུག་གི་འབྲས་བུ་དང་ཨ་ཤྭད་ཐའི་འབྲས་བུ་དང་ཨུ་དུམ་བཱ་རའི་འབྲས་བུ་དང་པ་རུ་ཤ་ཀའི་འབྲས་བུ་དང་འབྲ་གོ་དང་རྒུན་འབྲུམ་རྣམས་ཀྱི་ཁུ་བའི་བཏུང་བ་ཁྱེར་ནས
en: Understanding that by his silence the Blessed One had given his assent, Kaineya prepared eight different beverages—apple juice, banana juice, juniper juice, fig juice, udumbara juice, wild date palm berry juice, buckwheat juice, and grape juice—and went to present them to the Blessed One.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When he arrived he implored the Blessed One,

source: བཙུན་པ་བཏུང་བའི་རྣམ་གྲངས་བརྒྱད་པོ་འདི་དག་ནི་སྔོན་གྱི་དྲང་སྲོང་རྣམས་ཀྱིས་བསྟོད་པ་དང་ལེགས་པར་བརྗོད་པ་དང་བསྔགས་པ་དང་སྙན་པར་བརྗོད་པ་ལགས་ཀྱིས་ཐུགས་བརྩེ་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཞེས་པར་གསོལ་ཞེས་བྱས་སོ། །
en: “Lord, the great sages of the past have sung the praises of these eight different beverages, extolling their virtues and speaking highly of them. I implore the Blessed One to please accept them out of compassion for us.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བའི་ཕྱིར་དྲང་སྲོང་ཀཻ་ནེ་ཡའི་བཏུང་བའི་རྣམ་གྲངས་བརྒྱད་པོ་རྣམས་བཞེས་སོ། །
en: Out of compassion the Blessed One accepted the eight different beverages from Kaineya.

source: དགེ་སློང་དག་བཏུང་བའི་རྣམ་གྲངས་བརྒྱད་པོ་འདི་དག་ལས་རས་ཀྱིས་བཙགས་ཀྱང་རུང་མ་བཙགས་ཀྱང་རུང་དང་བ་ཡང་རུང་དང་བ་མ་ཡིན་པ་ཡང་རུང་རྙོག་པ་ཡང་རུང་རྙོག་པ་མ་ཡིན་པ་ཡང་རུང་མདོག་བཟང་བ་ཡང་རུང་མདོག་མི་བཟང་བ་ཡང་རུང་བ་རྣམས་ནི། དགེ་སློང་དང་དགེ་སློང་མ་དང་དགེ་ཚུལ་ཕ་དང་དགེ་ཚུལ་མ་རྣམས་ལ་དུས་སུ་བཏུང་བར་ངས་གནང་གི་དུས་མ་ཡིན་པར་མི་གནང་ངོ་། །
en: “Monks, I permit the monks, nuns, and female and male novices to drink all eight of these different beverages—be they filtered or unfiltered, clear or unclear, turbid or settled, of good color or not of good color— at the proper times of day, but not at improper times.

source: དགེ་སློང་དག་བཏུང་བའི་རྣམ་གྲངས་བརྒྱད་པོ་འདི་དག་ཉིད་ལས་རས་ཀྱིས་བཙགས་པ་དང་དང་བ་དང་མདངས་བཟང་བ་དང་རྙོག་པ་མ་ཡིན་པ་དང་སྙིགས་མ་མེད་པ་རྣམས་ནི་དུས་མ་ཡིན་པར་བཏུང་བར་བྱ་བ་ཡིན་ནོ། །
en: Of these eight different beverages, those filtered with cloth, clear, good in color, settled, and free of residue may be imbibed at improper times as well.”

source: དེ་ནས་དྲང་སྲོང་ཀ་ནེ་ཡས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The sage Kaineya bowed to the Blessed One with his palms pressed together and beseeched him,

source: བཙུན་པ་སང་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་བདག་གི་དེར་བཤོས་གསོལ་བར་ཅི་གནང་ཞེས་གསོལ་ནས།
en: “Lord, please allow me to request you and the saṅgha of monks to take your food at my house tomorrow,”

source: དེ་ནས་དྲང་སྲོང་ཀཻ་ནེ་ཡས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Understanding that by his silence the Blessed One had given his assent, Kaineya then asked the Blessed One,

source: བཙུན་པ་འོ་ན་བདག་ཅག་མཆིས་པའི་གནས་ནགས་ཁྲོད་འདི་ཉིད་དུ་དོ་ནུབ་བཞུགས་པར་གསོལ།
en: “In that case, Lord, may I request that you all stay here in the forest tonight?”

source: དེ་ནས་དྲང་སྲོང་ཁྱོད་ཇི་ལྟར་དགའ་བ་དེ་བཞིན་དུ་བྱའོ་ཞེས་བཀའ་སྩལ་ནས།
en: The Blessed One replied, “If it pleases you, Kaineya, we shall.”

source: བཅོམ་ལྡན་འདས་མཚོ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་ནས་མི་སྣང་བར་གྱུར་ཏེ་དྲང་སྲོང་ཀཻ་ནེ་ཡ་འདུག་པའི་གནས་ནས་ཐག་མི་རིང་བའི་ནགས་ཁྲོད་དེ་ཉིད་དུ་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: The Blessed One then disappeared from the banks of Lake Mandākinī and appeared seated in the forest with the saṅgha of monks, not far from where Kaineya lived.

source: དེ་ནས་དྲང་སྲོང་ཀཻ་ནེ་ཡ་ནམ་མ་ལངས་པར་ལངས་ནས་བྲམ་ཟེའི་ཁྱེའུ་རྣམས་ལ་བོས་ཏེ།
en: Early in the morning, before sunrise, Kaineya called to his young brahmins,

source: འཕགས་པ་དག་ལོངས།
en: “Noble ones, get up!

source: བཞིན་བཟངས་དག་ལོངས།
en: Get up, gentle ones, get up!

source: ཤིང་དག་གཤོགས། མེ་དག་བུས། འབྲས་ཆན་ཚོས། སྐྱུ་རུམ་སྒྲོལ། ཁུར་བ་དག་གྱིས། བཀད་སའི་ཞལ་ཏ་གྱིས་ཞེས་ཟེར་རོ། །
en: Attend to your reception room duties—split wood, make a fire, cook up the rice, prepare the vegetables, and make fried bread!”

source: དེའི་ནུབ་མོ་དྲང་སྲོང་རི་བོ་ཡང་དྲང་སྲོང་ཀཻ་ནེ་ཡ་འདུག་པའི་གནས་ན་འདུག་པར་གྱུར་ཏེ།
en: Kaineya was not the only one staying there that night.

source: དྲང་སྲོང་རི་བོས་དྲང་སྲོང་ཀཻ་ནེ་ཡ་ནམ་མ་ལངས་པར་ལངས་ནས་བྲམ་ཟེའི་ཁྱེའུ་རྣམས་ལ་བོས་ཏེ་འཕགས་པ་དག་ལོངས།
en: Śaila was there as well, and he heard Kaineya calling out to the young brahmins early in the morning before sunrise, “Noble ones, get up!

source: ཤིང་དག་གཤོགས། མེ་དག་བུས། འབྲས་ཆན་ཚོས། སྐྱུ་རུམ་དག་སྒྲོལ། ཁུར་བ་དག་གྱིས། བཀད་སའི་ཞལ་ཏ་གྱིས་ཞེས་ཟེར་བ་ཐོས་སོ། །
en: Attend to your reception room duties—split wood, make a fire, cook up the rice, prepare the vegetables, and make fried bread!”

source: ཐོས་ནས་ཀྱང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: When he heard this he thought,

source: ཅི་དྲང་སྲོང་འདི་བག་མ་གཏོང་ངམ་བག་མ་ལེན་ཏམ་འོན་ཏེ་འདིས་ཡུལ་འཁོར་གྱི་མིའམ་ལག་བཟོའམ་ཕ་ཚན་ནམ་འཁོར་རམ་རྒྱལ་པོ་སྤྱན་འདྲེན་ནམ་སྙམ་ནས་
en: “What is this sage doing, sending off a bride to be married? Or is he about to receive a bride, perhaps?

source: དྲང་སྲོང་རི་བོས་དྲང་སྲོང་ཀཻ་ནེ་ཡ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཅི་དྲང་སྲོང་ཁྱོད་བག་མ་གཏོང་ངམ་བག་མ་ལེན་ཏམ། འོན་ཏེ་ཁྱོད་ཡུལ་འཁོར་གྱི་མིའམ་ལག་བཟོའམ་ཕ་ཚན་ནམ་འཁོར་རམ་རྒྱལ་པོ་བཤོས་ལ་སྤྱན་འདྲེན་ནམ།
en: If not, he must be hosting foreign visitors, or craftsmen, or a group of men, or perhaps the king and his retinue.”

source: དྲང་སྲོང་ཀཻ་ནེ་ཡས་སྨྲས་པ། བདག་ནི་བག་མ་གཏོང་བའམ་བག་མ་ལེན་པ་ཡང་མི་བྱེད་ལ།
en: Wondering about this, Śaila asked Kaineya, “What are you doing, sage, sending off a bride to be married? Or are you about to receive a bride, perhaps?

source: ཡུལ་འཁོར་གྱི་མིའམ་ལག་བཟོའམ་ཕ་ཚན་ནམ་འཁོར་རམ་རྒྱལ་པོ་ཡང་སྤྱན་མི་འདྲེན་གྱི།
en: If not, are you hosting foreign visitors, or craftsmen, or a group of men, or perhaps the king and his retinue?”

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སང་བཤོས་ལ་སྤྱན་འདྲེན་ནོ། །
en: “Rather, today I have invited the Buddha and the rest of the saṅgha of monks for a meal.”

source: དེ་ནས་དྲང་སྲོང་རི་བོས་སངས་རྒྱས་ཞེས་བྱ་བའི་སྒྲ་སྔོན་མ་ཐོས་པ་ཐོས་ནས་སྤུ་ཐམས་ཅད་ཟིང་ཞེས་བྱེད་དེ་དགའ་བ་སྐྱེས་སོ། །
en: When Śaila heard the name Buddha, a sound unlike any he had heard before, it gave him goosebumps, and filled him with joy.

source: དེ་ནས་དྲང་སྲོང་རི་བོས་དྲང་སྲོང་ཀཻ་ནེ་ཡ་ལ་སྨྲས་པ།
en: Śaila asked Kaineya,

source: དྲང་སྲོང་སངས་རྒྱས་ཞེས་བྱ་བ་དེ་སུ་ཞིག །
en: “Sage, who is this one you call ‘Buddha’?”

source: དྲང་སྲོང་ཀཻ་ནེ་ཡས་སྨྲས་པ། དྲང་སྲོང་གངས་རིའི་འདབ་ན་ཆུ་ཀླུང་གང་གཱའི་འགྲམ་ན་དྲང་སྲོང་སེར་སྐྱ་འདུག་པའི་གནས་ནས་ ཐག་མི་རིང་བ་ཞིག་ན། ཤཱཀྱ་རྣམས་ཀྱི་ནང་དུ་བུ་ཞིག་སྐྱེས་པ་ཡོད་དོ། །
en: “Sage,” Kaineya replied, “near the Himalayas, on the banks of the Ganges, not far from the dwelling of Kapila, a child was born to the Śākyas.

source: དེ་བྲམ་ཟེ་མཚན་མཁན་བྱེ་བྲག་ཕྱེད་པ་རྣམས་ཀྱིས་ལུང་བསྟན་ཏེ་གལ་ཏེ་ཁྱིམ་གྱི་ནང་ན་གནས་ན་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་རོ། །
en: The brahmin soothsayers and augurs made this prediction about him: ‘If he remains here at home, he will become a universal monarch,

source: དེ་སྟེ་སྐྲ་དང་ཁ་སྤུ་དག་བྲེགས་ནས་ཆོས་གོས་ཚོན་ཅན་དག་བགོས་ཏེ། ཡང་དག་པའི་དད་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ན་ནི་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པ་ལས།
en: but if he shaves his head and face and dons the colorful robes of the holy, and if with nothing short of perfect faith he goes forth from home to live as a mendicant, then he will be renowned throughout the world as a tathāgata, an arhat, a totally and completely awakened buddha.’

source: དེ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་ཆོས་གོས་ཚོན་ཅན་དག་བགོས་ཏེཡང་དག་པའི་དད་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་སྟེ། དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: He shaved his head and face and donned the colorful religious robes, and with nothing short of perfect faith went forth from home to live as a mendicant until he awakened unto unexcelled, total, and complete enlightenment.

source: དྲང་སྲོང་སངས་རྒྱས་ཞེས་བྱ་བ་ནི་དེ་ཡིན་ནོ། །
en: This, O sage, is the one we call Buddha.”

source: དྲང་སྲོང་དགེ་འདུན་ཞེས་བྱ་བ་སུ་ཞིག །
en: “Sage, who are those you call ‘saṅgha’?”

source: དྲང་སྲོང་རྒྱལ་རིགས་མཁས་པ་དག་ཀྱང་ཡོད་བྲམ་ཟེ་མཁས་པ་དང་ཁྱིམ་བདག་མཁས་པ་དང་དགེ་སློང་མཁས་པ་དག་ཀྱང་ཡོད་དེ།
en: “O sage, among them are wise warriors, wise brahmins, wise householders, and wise mendicants as well.

source: དེ་དག་ལས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རབ་ཏུ་བྱུང་བ་དེའི་རྗེས་སུ་རབ་ཏུ་བྱུང་བ་དེ་དག་ནི་དྲང་སྲོང་དགེ་འདུན་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: They are all those who have gone forth to follow the Tathāgata, the Arhat, the totally and completely awakened Buddha. These, sage, are the ones I call the saṅgha.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་དེ་དག་བདག་གིས་སང་བཤོས་ལ་སྤྱན་འདྲེན་ནོ། །
en: Today I have invited the Buddha and the rest of the saṅgha of monks for a meal.”

source: དྲང་སྲོང་བཅོམ་ལྡན་འདས་དེ་ད་ལྟར་གང་ན་བཞུགས།
en: “Where is the Blessed One now, sage?”

source: དྲང་སྲོང་ཀ་ནེ་ཡས་སྨྲས་པ། དྲང་སྲོང་ཡུལ་ཨ་དུ་མ་འདི་ཉིད་ན་ནགས་ཁྲོད་འདི་ཁོ་ན་ན་བཞུགས་ཀྱིས།
en: “In the forests of the Adumā region, sage,” replied Kaineya.

source: གལ་ཏེ་བལྟ་བར་འདོད་པ་ལྟ་ན།
en: “If you wish to see him,

source: བྲམ་ཟེ་ནགས་ཁྲོད་ཉམས་དགའ་བ། །ག་ལ་འདུག་པ་དེར་སོང་དང་། །
en: “Brahmin, head to the beautiful forest, For that is where he is.

source: དྲི་ཟའི་རྒྱལ་པོ་འདྲ་བ་ཡི། །འདྲེན་པ་སངས་རྒྱས་མཐོང་བར་འགྱུར། །
en: There you shall see the Buddha, our guide, Holding court like a gandharva king.”

source: དེ་ནས་དྲང་སྲོང་རི་བོས་དྲང་སྲོང་ཀཻ་ནེ་ཡའི་ཚིག་མཉན་ཏེ་ནགས་ཁྲོད་དེ་ག་ལ་འདུག་པ་དེར་སོང་ནས།
en: Śaila heeded Kaineya’s advice and went to the forest to see the Blessed One.

source: དྲང་སྲོང་རི་བོས་ཐག་རིང་པོ་ཞིག་ནས།
en: There he saw the Blessed One from a distance.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་ཅིང་སྦ་བར་བྱས་པ་མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ་མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ་མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ།
en: His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire, like tongues of fire stoked with ghee, like a lamp set in a golden vessel,

source: མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ་བློ་གསལ་ཞིང་དྲི་མ་མེད་ལ་རྣམ་པར་དག་པ་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: and like a pillar adorned with all manner of jewels. He was immaculate, clear-minded, and pure of heart. He saw the Blessed Buddha,

source: མཐོང་ནས་ཀྱང་མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཏེ་དགེ་བའི་རྩ་བ་བསགས་པའི་རྒྱུ་ལས་བྱུང་བའི་སེམས་ཅན་གྱིས་དང་པོ་སངས་རྒྱས་མཐོང་བའི་ཉམས་བདེ་བ་ཅི་འདྲ་བ་དེ་ལྟ་བུ་ནི་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཞི་གནས་ཀྱི་སེམས་ལ་གོམས་པར་བྱས་པ་ལ་ཡང་ཉམས་བདེ་བ་དེ་ལྟ་བུ་སྐྱེ་བར་མི་འགྱུར་རོ། །
en: and the sight of him filled him with supreme joy, for beings who have gathered the roots of virtue to see a buddha for the first time experience such rapture as is not to be had even by those who practice calm abiding meditation for twelve years.

source: དེ་ལྟར་མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: After he saw the Blessed Buddha in this way, he approached him, touched his head to his feet, and sat before him to listen to the Dharma.

source: དེས་ན་དྲང་སྲོང་རི་བོས་སྟན་དེ་ཁོ་ན་ལ་འདུག་བཞིན་དུ་བདེན་པ་མངོན་པར་རྟོགས་པའི་མོད་ལ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: When he heard it, the sage Śaila destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of non-return right where he sat.

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དྲང་སྲོང་ཁྱོད་ཀྱིས་འཁོར་རྣམས་ལ་བཟླུགས་སམ།
en: “Sage, have you consulted your retinue?” asked the Blessed One.

source: དྲང་སྲོང་རི་བོས་གསོལ་བ། བཙུན་པ་མ་བཟླུགས་ལགས་སོ། །
en: “No, Lord,” replied Śaila, “I have not.”

source: དྲང་སྲོང་འོ་ན་འཁོར་རྣམས་ལ་ཇེ་ཟླུགས་ཤིག་དང་། འཁོར་ལ་བཟླུགས་པ་ནི་འདི་ལྟ་སྟེ།
en: “In that case, sage, first consult your retinue.

source: ཁྱེད་ལྟ་བུ་གྲགས་པ་དང་ལྡན་པ་ཀུན་གྱིས་ཤེས་པ་བསོད་ནམས་ཆེན་པོ་དང་ལྡན་པ་དག་ལ་ལེགས་པ་ཁོ་ན་ཡིན་ནོ། །
en: It is only fitting that a person like yourself, renowned by all and possessed of great merit, should do so.”

source: དེ་ནས་དྲང་སྲོང་རི་བོ་བྲམ་ཟེའི་ཁྱེའུ་རྣམས་ག་ལ་འཁོད་པ་དེར་སོང་སྟེ་ཕྱིན་ནས། བྲམ་ཟེའི་ཁྱེའུ་རྣམས་ལ་སྨྲས་པ།
en: So Śaila went to see his young brahmins, and when he arrived he informed them,

source: བྲམ་ཟེའི་ཁྱེའུ་དག་ཤེས་པར་གྱིས་ཤིག །བདག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་འདོད་ན་
en: “Young brahmins, I must let you know that I wish to practice the holy life in the presence of the Blessed One.

source: ཁྱེད་ཇི་ལྟར་བྱེད།
en: What will you do now?”

source: དེ་དག་གིས་སྨྲས་པ། བདག་ཅག་ཅི་འཚལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་མཁན་པོ་ལས་བརྟེན་པར་བས་ཀྱིས་
en: “It is with your support, preceptor, that we have sought anything at all,” they replied.

source: གལ་ཏེ་མཁན་པོ་དགེ་སྦྱོང་གཽ་ཏ་མའི་ཐད་དུ་རབ་ཏུ་འབྱུང་བ་ལྟ་ན། བདག་ཅག་ཀྱང་མཁན་པོ་རབ་ཏུ་བྱུང་བའི་རྗེས་སུ་རབ་ཏུ་འབྱུང་བར་འཚལ་ལོ། །
en: “Should the ascetic Gautama lead our preceptor to go forth, we will go forth as well.”

source: དྲང་སྲོང་རི་བོས་སྨྲས་པ། བྲམ་ཟེའི་ཁྱེའུ་དག་ད་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་ དེ་ལྟར་གྱིས་ཤིག །
en: “Young brahmins,” Śaila said, “if you are certain the time is right, then may it be so.”

source: དེ་ནས་དྲང་སྲོང་རི་བོ་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: Then Śaila went to see the Blessed One along with his five hundred devotees.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When he arrived he touched his head to the Blessed One’s feet, and then petitioned the Blessed One:

source: བཙུན་པ་བདག་གིས་འཁོར་རྣམས་ལ་བཟླུགས་ལགས་ན། བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, I have consulted my devotees, and if permitted, Lord, we wish to go forth in the Dharma and Vinaya so well spoken, complete our novitiates, and achieve full ordination.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བ་བཀའ་སྩལ་ཏེ་དགེ་སློང་དག་ཚུར་ཤོག་ཚངས་པར་སྤྱོད་ཅིག་ཅེས་བཀའ་སྩལ་ནས།
en: “Come, join me, monks!” the Blessed One replied. “Practice the holy life.”

source: ཚིག་དེ་སྐད་ཅེས་བཀའ་སྩལ་པའི་མོད་ལ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་ཞག་བདུན་ལོན་པ་ཙམ་དུ་གྱུར། སྤྱོད་ལམ་ནི་བསྙེན་པར་རྫོགས་ནས་ལོ་བརྒྱ་ལོན་པ་ལྟ་བུར་གྱུར། ལག་ན་ནི་ལྷུང་བཟེད་དང་ཆུ་སྣོད་ཐོགས་པར་གྱུར་ཏོ། །
en: As soon as the Blessed One had finished speaking there they stood, alms bowl and water pitcher in hand, with but a week’s worth of hair and beard, and with the deportment of a monk who had been ordained for one hundred years.

source: དེ་བཞིན་གཤེགས་པས་ཚུར་ཞེས་བཀའ་སྩལ་པས། །དེ་དག་མགོ་བྲེགས་ལུས་ལ་སྣམ་སྦྱར་གྱོན། །སངས་རྒྱས་ཀྱི་ནི་དགོངས་པས་གོས་བགོས་ནས། མོད་ལ་དབང་པོ་རབ་ཏུ་ཞི་བར་གནས། །
en: Garbed in robes, with shaven heads, And senses stilled by Buddha’s will— From the very moment the One Thus Gone Spoke to them, saying, “Come, join me.”

source: དེ་ནས་དྲང་སྲོང་ཀཻ་ནེ་ཡས་དེའི་ནུབ་མོ་ཉིད་དུ་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་སྟ་གོན་བྱས་ནས། ནང་པར་སྔར་ལངས་ནས་གདན་བཤམས་ནས་ཕྱག་ཆབ་ཀྱི་ཆུ་ར་བཀང་སྟེ།
en: After preparing many good, wholesome foods that night, Kaineya rose in the morning, prepared seats, filled the water pots, and set them out.

source: བཅོམ་ལྡན་འདས་ལ་ཕྲིན་གྱིས་གདུགས་ཚོད་བསྐུལ་བ། བཙུན་པ་གདུགས་ཚོད་ལ་བབ་སྟེ། བཤོས་གསོལ་ལགས་ན།
en: Then he sent a message to the Blessed One reminding him it was time for the midday meal: “Lord, the midday meal is upon us.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ་ལྷུང་བཟེད་བསྣམས་ནས་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཞབས་འབྲིང་བྱས་ཏེ་དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས།
en: That morning the Blessed One donned his lower garment and Dharma robes, and, carrying his alms bowl, set out surrounded and attended by an assembly of monks, until they arrived at Kaineya’s reception room.

source: དྲང་སྲོང་ཀཻ་ནེ་ཡའི་བཀད་ས་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་གདན་བཤམས་པ་ལ་བཞུགས་སོ། །
en: There, the Blessed One took his place on the seat prepared for him

source: དེ་ནས་དྲང་སྲོང་ཀཻ་ནེ་ཡས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ་ཅི་བཞེད་པ་བསྟབས་སོ། །
en: and Kaineya by his own hand contented the Buddha and the rest of the saṅgha of monks with many good, wholesome foods, proffering all that they wished.

source: དེ་ནས་དྲང་སྲོང་ཀཻ་ནེ་ཡས་དྲང་སྲོང་རི་བོ་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་རབ་ཏུ་བྱུང་སྟེ་གྲལ་དེ་ཉིད་ན་འཁོད་པ་མཐོང་ངོ་། །
en: Kaineya saw that Śaila and his five hundred devotees had gone forth, and thus were also seated there.

source: མཐོང་ནས་ཀྱང་དྲང་སྲོང་རི་བོ་ལ་སྨྲས་པ།
en: Recognizing this, he asked Śaila,

source: དྲང་སྲོང་ཁྱོད་རབ་ཏུ་བྱུང་ངམ།
en: “Sage, have you gone forth?”

source: གྲོགས་པོ་བདག་རབ་ཏུ་བྱུང་ངོ་། །
en: “Yes, my friend, I have gone forth.”

source: དྲང་སྲོང་ཀཻ་ནེ་ཡས་སྨྲས་པ་ལེགས་སོ། །
en: “Good!”

source: ཤིན་ཏུ་ལེགས་སོ། །
en: Sage Kaineya said, “Very good!

source: བདག་ཀྱང་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བཤོས་གསོལ་ཟིན་ནས་རབ་ཏུ་འབྱུང་ངོ་ཞེས་སྨྲས་ནས།
en: I too shall go forth after the Blessed One and the rest of the saṅgha of monks have finished eating.”

source: དྲང་སྲོང་ཀཻ་ནེ་ཡས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་རྣམ་གྲངས་དུ་མས་ཚིམ་པར་བྱས་ཏེ་ཅི་བཞེད་པ་བསྟབས་ནས་བཅོམ་ལྡན་འདས་བཤོས་གསོལ་ཟིན་ཏེ
en: After contenting them by his own hand with many different kinds of good, wholesome food, proffering all that they wished,

source: གསང་སྡེར་ནི་གྱུ་ཕྱག་ནི་བཅབས་པར་རིག་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: once he knew that the Blessed One had finished eating, his bowl had been taken away, and his hands washed, he drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and requested,

source: དྲང་སྲོང་ཀཻ་ནེ་ཡས་གསོལ་པ། བཙུན་པ་མ་བཟླུགས་ལགས་སོ། །
en: “No, Lord,” replied Kaineya, “I have not.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དྲང་སྲོང་འོ་ན་འཁོར་རྣམས་ལ་ཇེ་ཟླུགས་ཤིག་དང་།
en: “In that case, sage, first consult your retinue.

source: འཁོར་ལ་བཟླུགས་པ་ནི་འདི་ལྟ་སྟེ། ཁྱོད་ལྟ་བུ་གྲགས་པ་དང་ལྡན་པ་ཀུན་གྱིས་ཤེས་པ་བསོད་ནམས་ཆེན་པོ་དང་ལྡན་པ་དག་ལ་ལེགས་པ་ཁོ་ན་ཡིན་ནོ། །
en: It is only fitting that a person like yourself, renowned by all and possessed of great merit, should do so.”

source: དེ་ནས་དྲང་སྲོང་ཀཻ་ནེ་ཡ་བྲམ་ཟེའི་ཁྱེའུ་རྣམས་ག་ལ་འཁོད་པ་དེར་སོང་སྟེ་ཕྱིན་ནས་བྲམ་ཟེའི་ཁྱེའུ་རྣམས་ལ་སྨྲས་པ།
en: So Kaineya went to see his young brahmins, and when he arrived he informed them,

source: དེ་དག་གིས་སྨྲས་པ། བདག་ཅག་ཅི་འཚལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་མཁན་པོ་ལས་བརྟེན་པར་བས་ཀྱིས་གལ་ཏེ་མཁན་པོ་དགེ་སྦྱོང་གཽ་ཏ་མའི་ཐད་དུ་རབ་ཏུ་འབྱུང་བ་ལྟ་ན། བདག་ཅག་ཀྱང་མཁན་པོ་རབ་ཏུ་བྱུང་བའི་རྗེས་སུ་རབ་ཏུ་འབྱུང་བར་འཚལ་ལོ། །
en: “It is with your support, preceptor, that we have sought anything at all,” they replied. “Should the ascetic Gautama lead our preceptor to go forth, we will go forth as well.”

source: དྲང་སྲོང་ཀཻ་ནེ་ཡས་སྨྲས་པ། བྲམ་ཟེའི་ཁྱེའུ་དག་ད་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་དེ་ལྟར་གྱིས་ཤིག །
en: “Young brahmins,” Kaineya said, “if you are certain the time is right, then may it be so.”

source: དེ་ནས་དྲང་སྲོང་ཀཻ་ནེ་ཡ་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: So Kaineya went to see the Blessed One along with his five hundred devotees, and when he arrived he touched his head to the feet of the Blessed One, and told him,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བ་བཀའ་སྩལ་ཏེ་དགེ་སློང་དག་ཚུར་ཤོག །
en: “Come, join me, monks!” replied the Blessed One.

source: ཚངས་པར་སྤྱོད་ཅིག་ཅེས་བཀའ་སྩལ་ནས།
en: “Practice the holy life.”

source: ཚིག་འདི་སྐད་ཅེས་བཀའ་སྩལ་པའི་མོད་ལ་སྐྲ་དང་ཁ་སྤུ་ནི་བྲེགས་ནས་ཞག་བདུན་ལོན་པ་ཙམ་དུ་གྱུར། སྤྱོད་ལམ་ནི་བསྙེན་པར་རྫོགས་ནས་ལོ་བརྒྱ་ལོན་པ་ལྟ་བུར་གྱུར། ལག་ན་ནི་ལྷུང་བཟེད་དང་ཆུ་སྣོད་ཐོགས་པར་གྱུར་ཏོ། །
en: As soon as the Blessed One had finished speaking there they stood, alms bowl and water pitcher in hand, with but a week’s worth of hair and beard, and with the deportment of a monk who had been ordained for one hundred years.

source: དེ་བཞིན་གཤེགས་པས་ཚུར་ཞེས་བཀའ་སྩལ་པས། །དེ་དག་མགོ་བྲེགས་ལུས་ལ་སྣམ་སྦྱར་གྱོན། །སངས་རྒྱས་ཀྱི་ནི་དགོངས་པས་གོས་བགོས་ནས། །མོད་ལ་དབང་པོ་རབ་ཏུ་ཞི་བར་གནས། །
en: Garbed in robes, with shaven heads, And senses stilled by Buddha’s will— From the very moment the One Thus Gone Spoke to them, saying, “Come, join me.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་རི་བོ་དང་ཀཻ་ནེ་ཡ་ལ་གདམས་ངག་བྱིན་ནས། དེ་གཉིས་ཀྱིས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: The Blessed One taught Śaila and Kaineya, and they cast away all afflictive emotions through diligence, practice, and effort, and manifested arhatship.

source: དགེ་སློང་ལྷག་མ་དེ་དག་ལས་ཀྱང་དགེ་སློང་ལྔ་བརྒྱ་ནི་ཚེ་དང་ལྡན་པ་བྲམ་ཟེ་ཀ་པི་ན་ཆེན་པོ་ལ་གཏད་དོ། །
en: He entrusted five hundred of their monks to Venerable Brāhmaṇa Mahā­kapina,

source: ཉིས་བརྒྱ་ལྔ་བཅུ་ནི་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་གཏད་དོ། །
en: two hundred and fifty to Venerable Śāriputra,

source: ཉིས་བརྒྱ་ལྔ་བཅུ་ནི་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ལ་གཏད་དེ།
en: and two hundred and fifty to Venerable Maudgalyāyana,

source: ཁྱེད་ཀྱིས་འདི་རྣམས་ལ་གདམས་ངག་སྟོན་ཅིག །
en: and told them, “Give them your spiritual advice,

source: འདི་རྣམས་ལ་ཡིད་ལ་བྱེད་པའི་ལུང་ཡང་ཕོག་ཤིག །
en: and then instruct them to keep it in mind.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་ཇི་སྐད་སྩལ་པ་དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་གསོལ་ནས།
en: “Yes, Blessed One,” they agreed. “We will do just as you have instructed.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་དང་ཚེ་དང་ལྡན་པ་བྲམ་ཟེ་ཀ་པི་ན་ཆེན་པོ་རྣམས་ཀྱིས་དགེ་སློང་དེ་དག་ཁྲིད་དེ་ཆུ་ཀླུང་གསེར་ལྡན་གྱི་འགྲམ་དུ་དབྱར་གནས་པར་དམ་བཅས་སོ། །
en: Venerable Śāriputra, Venerable Maudgalyāyana, and Venerable Brāhmaṇa Mahā­kapina brought the monks to the banks of the Hiraṇyavatī River, where they pledged to stay in retreat during the rains.

source: དེ་རྣམས་ཀྱིས་དབྱར་གནས་པར་དམ་བཅས་ནས་དེ་དག་ལ་ཡིད་ལ་བྱེད་པའི་ལུང་ཕོག་སྟེ།
en: While observing their pledge to stay in retreat during the rains, they were given instructions to ponder.

source: དེར་ཚེ་དང་ལྡན་པ་བྲམ་ཟེ་ཀ་པི་ནས་དགེ་སློང་ལྔ་བརྒྱ་པོ་དེ་དག་དགྲ་བཅོམ་པ་ཉིད་ལ་བཀོད་དོ། །
en: Venerable Brāhmaṇa Kapina established his five hundred monks in arhatship,

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུས་ནི་ཉིས་བརྒྱ་ལྔ་བཅུ་པོ་དེ་དག་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་བཀོད་དོ། །
en: Venerable Maudgalyāyana established his two hundred and fifty monks in the resultant state of non-return,

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ནི་ཉིས་བརྒྱ་ལྔ་བཅུ་པོ་དེ་དག་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་བཀོད་དོ། །
en: and Venerable Śāriputra established his two hundred and fifty monks in the resultant state of stream entry.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཉན་ཐོས་རྣམས་ནི་ཆོས་ཉིད་ཀྱིས་དུས་གཉིས་སུ་ཕལ་པོ་ཆེ་འདུ་བར་འགྱུར་ཏེ།
en: Now there are two times of year when it is customary for the disciples of the Blessed Buddha to convene—

source: དབྱར་ཟླ་འབྲིང་པོ་ལ་དབྱར་གནས་པའི་དུས་ལ་བབ་པ་དང་། སྟོན་ཟླ་ཐ་ཆུངས་ཉ་ལ་འདུ་བར་འགྱུར་ཏེ།
en: in the middle of the summer months when the time comes for the summer retreat, and on the full moon of the last month of autumn.
